package LessonOne;

public class program {
    public static void main(String[] args) {
        System.out.println("Текст");
        // Вывод: Текст
        // Коментарий в одну строку.
        /**
         * Много
         * коментариев
         */
        String s = "Wau";
        // Объявление и присвоение строкового типа дыннах.
        System.out.println(s);
        // Вывод значения переменной.
        s.charAt(1); //
        // Обращение к конкретному символу строки.
        int i = 10_000;
        // Объявление и присвоение целочисленного типа дыннах.
        short age = 10;
        // Объявление и присвоение ? типа дыннах.
        float f = 2.7f;
        // Объявление и присвоение ? типа дыннах.
        double pi = 3.1415;
        // Объявление и присвоение вещественного типа дыннах.
        char ch = '{';
        // Объявление и присвоение символьного типа дыннах.
        var t = 123;
        // Объявление и присвоение неизвестного заранее типа дыннах.
    }
}
